W9D3/cats_99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex") VALUES ($1, $2, $3, $4) RETURNING "id"  [["birth_date", "2019-06-13"], ["color", "black"], ["name", "campbell"], ["sex", "F"]]
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save