W10D4/reddit_clone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
    <h3>Post to these subs</h3>
    <% Sub.all.each do |sub| %>