W9D5/music_app_w_testing/app/controllers/application_controller.rb

    def current_user
        return nil unless session[:session_token]
        User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "vidtpsW4VfF83Cvykf3n7A"], ["LIMIT", 1]]