W9D5/music_app_w_testing/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "campbellsoleson@gmail.com"], ["password_digest", "$2a$12$aNOCWk6j3cfqRlJ8JYkkGOVAn.bw9MJL9PqoFLIjhk3RUJ6sleuui"], ["session_token", "ci7c8W-SkPj8gyMZybqxiA"]]