W10D4/reddit_clone/app/controllers/posts_controller.rb

    def create
        @post = current_user.posts.new(post_params)
        @subs ||= Sub.all #ask this shit

        if @post.save
            flash[:sucess] = "you did it bud"
            redirect_to post_url(@post)
        else
            flash[:error] = "try again"
            render :new
        end

        params[:post][:sub_id].each do |sub_id|
            PostSub.create!(post_id: @post.id, sub_id: sub_id)
---
SELECT "subs".* FROM "subs"
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 11], ["sub_id", 1], ["created_at", "2019-06-27 23:29:25.748656"], ["updated_at", "2019-06-27 23:29:25.748656"]]