W10D4/reddit_clone/app/controllers/subs_controller.rb

    def create
        @sub = current_user.subs.new(subs_params)
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def edit
        @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @sub = Sub.find(params[:id])
        if current_user.id == @sub.moderator.id
            if @sub.update(subs_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "all the shit that I think is dope"], ["updated_at", "2019-06-27 21:09:09.036823"], ["id", 1]]