W10D4/reddit_clone/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "session_token", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "campbellsoleson@gmail.com"], ["session_token", "dgOnksjCPGAaVUCPChuQ1A"], ["password_digest", "$2a$12$7QGdOQEvNDdMKl9pDzFZZ.rNOWeemsjcaxP33Bq/6EP4GwtYUIcYS"]]