W9D5/music_app_w_testing/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "ePGNWepsTm3-pbfttkW3AA"], ["id", 11]]